export interface VersionLog {
  version: string;
  date?: string;
  changes: string[];
}

export const versionLogs: VersionLog[] = [
  {
    version: "2.13.0",
    date: "2025/11/25",
    changes: ["修复更新版本报未知错误", "增加版本更新内容"],
  },
  {
    version: "2.12.2",
    date: "2025/11/24",
    changes: ["修复可能存在的设置项变更导致的闪退问题"],
  },
  {
    version: "2.12.1",
    date: "2025/11/24",
    changes: ["修复设计新增单据选项导致闪退"],
  },
  {
    version: "2.12.0",
    date: "2025/10/29",
    changes: ["点单模式增加退出提示、支持指纹认证退出"],
  },
  {
    version: "2.11.0",
    date: "2025/10/10",
    changes: ["保存单据后的提示条支持设置自动关闭、设置自动关闭时间"],
  },
  {
    version: "2.10.2",
    date: "2025/10/10",
    changes: [
      "修复单据同步商品数量叠加",
      "修复可能存在的商品同步图片错位问题",
      "修复单据同步时缺少优惠信息",
    ],
  },
  {
    version: "2.10.1",
    date: "2025/10/10",
    changes: [
      "尝试修复新增单据成功提示无法关闭的问题",
      "优化单据同步逻辑，修复同步时可能出现的商品数量叠加问题",
    ],
  },
  {
    version: "2.10.0",
    date: "2025/09/18",
    changes: [
      "点单模式的卡片数量调整更直观",
      "有后台同步的新单据时，底部的对账按钮会显示小红点",
    ],
  },
  {
    version: "2.9.2",
    date: "2025/09/18",
    changes: [
      "修复点单模式下蓝牙同步失效",
      "满减满赠可以设置重复计算",
      "修复点单模式收款码不显示的问题",
      "修复点单模式下结算对话框总价为0的问题",
      "修复点单模式时下单成功不打印小票",
    ],
  },
  {
    version: "2.9.0",
    date: "2025/09/17",
    changes: ["支持点单模式", "支持宽屏设备多列显示"],
  },
  {
    version: "2.8.0",
    date: "2025/09/09",
    changes: [
      "支持蓝牙同步单据",
      "修复优惠信息编辑变成新增的问题",
      "同步商品时如果有满赠信息也会同步",
      "优化提示条显示，重复消息不再多次提示",
    ],
  },
  {
    version: "2.7.0",
    date: "2025/08/20",
    changes: ["修复部分布局", "页面顶部按钮长按时显示功能提示"],
  },
  {
    version: "2.6.0",
    date: "2025/08/18",
    changes: ["支持蓝牙同步商品（支持同步图片）", "增加同步商品进度条"],
  },
  {
    version: "2.5.0",
    date: "2025/08/17",
    changes: [
      "支持商品添加图片",
      "新增满减、满赠设置，可在商品编辑界面编辑",
      "新增wifi局域网同步商品，双方链接局域网并打开服务后可连接对方设备进行同步，或直接输入局域网ip连接(图片仅支持wifi同步，扫码和倒入文件不支持同步图片)",
      "新的商品入单数量调节逻辑，新界面布局下，支持双指滑动商品调节数量，单指点按数量卡片可弹出全新的数量调节模块",
    ],
  },
  {
    version: "2.2.0",
    date: "2025/08/11",
    changes: [
      "支持扫码枪入单功能",
      "支持导出二维码、条码图片到手机",
      "使用 mlkit 识别二维码",
    ],
  },
  {
    version: "2.0.3",
    date: "2024/04/16",
    changes: ["新的单据界面", "标签的多选逻辑变为多个标签取交集"],
  },
  {
    version: "1.7.0",
    date: "2024/04/16",
    changes: ["商品价格支持小数"],
  },
  {
    version: "1.6.1",
    date: "2024/04/08",
    changes: ["修复单据导出错位问题"],
  },
  {
    version: "1.6.0",
    date: "2024/04/03",
    changes: [
      "支持扫码入库功能，支持导出条码(ean13)和二维码 (部分打印机可能不支持打印条码，建议使用二维码)",
      "支持自定义商品 UUID(条码号)",
    ],
  },
  {
    version: "1.5.3",
    date: "2023/10/19",
    changes: ["修复卡片背景色"],
  },
  {
    version: "1.5.2",
    date: "2023/10/19",
    changes: ["适配暗黑模式"],
  },
  {
    version: "1.5.1",
    date: "2023/9/05",
    changes: [
      "支持蓝牙打印机打印单据",
      "修复本地数据库某些情况下加载不出数据问题",
    ],
  },
  {
    version: "1.4.4",
    date: "2023/8/27",
    changes: ["修复弹出消息导致的闪退"],
  },
  {
    version: "1.4.3",
    date: "2023/8/25",
    changes: ["升级 kotlin 至1.9", "重构整体布局", "禁用暗黑模式"],
  },
  {
    version: "1.4.2",
    date: "2023/8/21",
    changes: ["支持导出 scv 格式的账单列表、商品列表", "导入商品支持备注"],
  },
  {
    version: "1.4.1",
    date: "2023/8/20",
    changes: ["修复删除单据时新单据列表库存不更新的问题"],
  },
  {
    version: "1.4.0",
    date: "2023/8/18",
    changes: ["支持 csv 导入货品"],
  },
  {
    version: "1.3.1",
    date: "2023/8/18",
    changes: ["优化下拉刷新"],
  },
  {
    version: "1.3.0",
    changes: ["单据明细内可以查看商品详情"],
  },
  {
    version: "1.2.1",
    changes: ["查看备注时隐藏确认按钮/无备注单点不显示备注"],
  },
  {
    version: "1.2.0",
    changes: ["功能更新: 长按单据列表可设置备注，单点可查看备注"],
  },
  {
    version: "1.1.0",
    changes: ["功能更新: 添加套装商品的设置功能"],
  },
  {
    version: "1.0.2",
    changes: ["修复单据详情内编辑物品数量库存显示不正确"],
  },
  {
    version: "1.0.1",
    changes: [
      "修复 MIUI 冷启动白屏问题",
      "修复 MIUI 退出应用行为与其他 ROM 不一致的问题",
    ],
  },
  {
    version: "1.0",
    changes: ["正式版发布"],
  },
];

// 根据版本号获取版本日志
export function getVersionLog(version: string): VersionLog | undefined {
  return versionLogs.find((log) => log.version === version);
}
